# Contents
* CSV file
* Dataframe, attributes and methods
* Comparison Operators
* Bitwise Operators
* Exercise -1

In [0]:
#getting rid of all the unwanted warnings.
import warnings
warnings.simplefilter('ignore')

In [0]:
#importing pandas - python's data handeling libraries
import pandas as pd

# Introducing a new data format

* This time we will use another format of storing data known as .csv files. 
* This are text files in which data is stored seperated by charachter like comma,space etc.
* In pandas .csv file is reffered as data frame.

In [7]:
df = pd.read_csv('WHO POP TB all.csv')
print(type(df)) #type() function returns the class of the input variable.

<class 'pandas.core.frame.DataFrame'>

## About Dataframes
* Methods are said to be a property of a dataframe. 
* In addition to methods, dataframes have another property  attributes.
* A dataframe attribute is like a variable that can be accessed only in the context of dataframe.
* All the attributes are accessed using a <b>.dot notation</b>

In [8]:
#one such attributes is columns
df.columns

Index(['Country', 'Population (1000s)', 'TB deaths'], dtype='object')

## Displaying dataframe rows
* A dataframe has a default integer index for its rows, which starts at 0 (zero). 
* You can get and display any single row in a dataframe by using the <b>iloc</b> attribute with the index of the row you want to access as its argument. 
* using the <b>head()</b> method you can print a collection of rows from starting.
 * If you don't pass any number(index) it will return the first 5 rows.   
* The <b>tail()</b> method is same as head() but only return the entries from end.

In [9]:
df.iloc[0] #Returns the first row of the dataframe.

Country               Afghanistan
Population (1000s)          30552
TB deaths                   13000
Name: 0, dtype: object

In [11]:
df.head() #default, will return first 5 entries.

       Country  Population (1000s)  TB deaths
0  Afghanistan               30552   13000.00
1      Albania                3173      20.00
2      Algeria               39208    5100.00
3      Andorra                  79       0.26
4       Angola               21472    6900.00

In [13]:
df.head(10) #This will returnt the first 10 entries.

               Country  Population (1000s)  TB deaths
0          Afghanistan               30552   13000.00
1              Albania                3173      20.00
2              Algeria               39208    5100.00
3              Andorra                  79       0.26
4               Angola               21472    6900.00
5  Antigua and Barbuda                  90       1.20
6            Argentina               41446     570.00
7              Armenia                2977     170.00
8            Australia               23343      45.00
9              Austria                8495      29.00

In [14]:
df.tail() #returns the last 5 entries.

                                Country  Population (1000s)  TB deaths
189  Venezuela (Bolivarian Republic of)               30405      480.0
190                            Viet Nam               91680    17000.0
191                               Yemen               24407      990.0
192                              Zambia               14539     3600.0
193                            Zimbabwe               14150     5700.0

In [15]:
df.tail(10) #returns the last 10 entries.

                                Country  Population (1000s)  TB deaths
184         United Republic of Tanzania               49253     6000.0
185            United States of America              320051      490.0
186                             Uruguay                3407       40.0
187                          Uzbekistan               28934     2200.0
188                             Vanuatu                 253       16.0
189  Venezuela (Bolivarian Republic of)               30405      480.0
190                            Viet Nam               91680    17000.0
191                               Yemen               24407      990.0
192                              Zambia               14539     3600.0
193                            Zimbabwe               14150     5700.0

# Dataframe Columns
* Accessing the columns in dataframe is same as in the previous notebook.
* But in dataframes the columns returned arein <b>series</b> datatype.
* The Series data type is a collection of values with an integer index that starts from zero.
* series datatype supports major methods of the dataframes studied above.

In [17]:
#Accessing a single column
df['TB deaths']

0      13000.00
1         20.00
2       5100.00
3          0.26
4       6900.00
         ...
189      480.00
190    17000.00
191      990.00
192     3600.00
193     5700.00
Name: TB deaths, Length: 194, dtype: float64

In [21]:
#The head()and tail() methods can be used in columns as well.
df['Country'].head(10)

0            Afghanistan
1                Albania
2                Algeria
3                Andorra
4                 Angola
5    Antigua and Barbuda
6              Argentina
7                Armenia
8              Australia
9                Austria
Name: Country, dtype: object

In [19]:
#Acessing multiple columns in pandas in the form of a list.
df[['Country', 'TB deaths']]

                                Country  TB deaths
0                           Afghanistan   13000.00
1                               Albania      20.00
2                               Algeria    5100.00
3                               Andorra       0.26
4                                Angola    6900.00
..                                  ...        ...
189  Venezuela (Bolivarian Republic of)     480.00
190                            Viet Nam   17000.00
191                               Yemen     990.00
192                              Zambia    3600.00
193                            Zimbabwe    5700.00

[194 rows x 2 columns]

# Dataframe Operators
* Dataframe supports all the python operators.
* +, -,*, /, %
* ==, >=, <=, >, <, !=
* &, |

In [22]:
df[df['Country'] == 'India'] #returns the row where country is India.

   Country  Population (1000s)  TB deaths
77   India             1252140   240000.0

In [29]:
#returns a dataframe where country starts with A or a letter later with A
df[df['Country'] > 'A']['Country']

0                             Afghanistan
1                                 Albania
2                                 Algeria
3                                 Andorra
4                                  Angola
                      ...
189    Venezuela (Bolivarian Republic of)
190                              Viet Nam
191                                 Yemen
192                                Zambia
193                              Zimbabwe
Name: Country, Length: 194, dtype: object

In [33]:
#returns the names of the country with its TB deaths where country's population is greater than 10000
df[df['Population (1000s)'] > 10000][['Country', 'TB deaths']]

                                Country  TB deaths
0                           Afghanistan    13000.0
2                               Algeria     5100.0
4                                Angola     6900.0
6                             Argentina      570.0
8                             Australia       45.0
..                                  ...        ...
189  Venezuela (Bolivarian Republic of)      480.0
190                            Viet Nam    17000.0
191                               Yemen      990.0
192                              Zambia     3600.0
193                            Zimbabwe     5700.0

[87 rows x 2 columns]

In [35]:
#returns the detailsof the country where population is greater than 50000 and death toll  > 1000.
population = df['Population (1000s)'] #you can assign a dataframe to avoid complex expression.
deaths = df['TB deaths']
df[(population > 50000) & (deaths > 1000)]

                              Country  Population (1000s)  TB deaths
13                         Bangladesh              156595    80000.0
23                             Brazil              200362     4400.0
36                              China             1393337    41000.0
47   Democratic Republic of the Congo               67514    46000.0
58                           Ethiopia               94101    30000.0
77                              India             1252140   240000.0
78                          Indonesia              249866    64000.0
79         Iran (Islamic Republic of)               77447     2500.0
85                              Japan              127144     2100.0
109                            Mexico              122332     2200.0
116                           Myanmar               53259    26000.0
124                           Nigeria              173615   160000.0
128                          Pakistan              182143    49000.0
134                       Philippines               98394    27000.0
141                Russian Federation              142834    17000.0
159                      South Africa               52776    25000.0
170                          Thailand               67010     8100.0
190                          Viet Nam               91680    17000.0

In [39]:
#To get the top 10 most affected countries by TB this will appear in the reverse order. 
sorted_df = df.sort_values('TB deaths')
sorted_df[['Country', 'TB deaths']].tail(10)

                              Country  TB deaths
116                           Myanmar    26000.0
134                       Philippines    27000.0
58                           Ethiopia    30000.0
36                              China    41000.0
47   Democratic Republic of the Congo    46000.0
128                          Pakistan    49000.0
78                          Indonesia    64000.0
13                         Bangladesh    80000.0
124                           Nigeria   160000.0
77                              India   240000.0

In [45]:
# Demo Exercise
#Return a number of rows where country name only starts with 'c' and population < 1000 
country = df['Country']
df[(country >= 'C') & (country < 'D') & (population < 1000)]

         Country  Population (1000s)  TB deaths
29    Cabo Verde                 499     150.00
38       Comoros                 735      58.00
40  Cook Islands                  21       0.41

# Exercise -1
Practice by making a copy of this notebook using File -> saveacopy in drive on google colab.
* <b>Question -1:</b> Print a dataframe where TB deaths are minimum, maximum.
* <b>Question -2:</b> print a maximum TB Deaths along with country name where Country name starts with only M.